EXAMPLE = {'объект': {0: 'Агафьев П.Ш.',
  1: 'Агафьев П.Ш.',
  2: 'Агафьев П.Ш.',
  3: 'Совок Л.Е.',
  4: 'Совок Л.Е.',
  5: 'Совок Л.Е.',
  6: 'Иванов А.С.',
  7: 'Иванов А.С.',
  8: 'Крутилкина К.Ф.',
  9: 'Рядовкин С.Ю',
  10: 'Рядовкин С.Ю',
  11: 'Рядовкин С.Ю',
  12: 'Петров П.Н.',
  13: 'Петров П.Н.',
  14: 'Петров П.Н.',
  15: 'Клементьев З.Т.',
  16: 'Рюриковна Г.А.',
  17: 'Рюриковна Г.А.',
  18: 'Рюриковна Г.А.',
  19: 'Васильев П.Г.',
  20: 'Васильев П.Г.',
  21: 'Васильев П.Г.'},
 'старт': {0: '07.04.2025',
  1: '09.06.2025',
  2: '25.08.2025',
  3: '23.06.2025',
  4: '15.09.2025',
  5: '17.11.2025',
  6: '08.09.2025',
  7: '24.11.2025',
  8: None,
  9: '16.06.2025',
  10: '11.08.2025',
  11: '22.12.2025',
  12: '30.06.2025',
  13: '25.08.2025',
  14: '22.09.2025',
  15: None,
  16: '10.03.2025',
  17: '04.08.2025',
  18: '05.11.2025',
  19: '12.05.2025',
  20: '25.08.2025',
  21: '17.11.2025'},
 'финиш': {0: '21.04.2025',
  1: '23.06.2025',
  2: '08.09.2025',
  3: '30.06.2025',
  4: '29.09.2025',
  5: '24.11.2025',
  6: '22.09.2025',
  7: '08.12.2025',
  8: None,
  9: '23.06.2025',
  10: '25.08.2025',
  11: '29.12.2025',
  12: '07.07.2025',
  13: '01.09.2025',
  14: '06.10.2025',
  15: None,
  16: '17.03.2025',
  17: '18.08.2025',
  18: '15.11.2025',
  19: '19.05.2025',
  20: '08.09.2025',
  21: '24.11.2025'},
 'данные': {0: 'Агафьев П.Ш. с 07 апр на 14 дней',
  1: 'Агафьев П.Ш. с 09 июн на 14 дней',
  2: 'Агафьев П.Ш. с 25 авг на 14 дней',
  3: 'Совок Л.Е. с 23 июн на 7 дней',
  4: 'Совок Л.Е. с 15 сен на 14 дней',
  5: 'Совок Л.Е. с 17 ноя на 7 дней',
  6: 'Иванов А.С. с 08 сен на 14 дней',
  7: 'Иванов А.С. с 24 ноя на 14 дней',
  8: None,
  9: 'Рядовкин С.Ю с 16 июн на 7 дней',
  10: 'Рядовкин С.Ю с 11 авг на 14 дней',
  11: 'Рядовкин С.Ю с 22 дек на 7 дней',
  12: 'Петров П.Н. с 30 июн на 7 дней',
  13: 'Петров П.Н. с 25 авг на 7 дней',
  14: 'Петров П.Н. с 22 сен на 14 дней',
  15: None,
  16: 'Рюриковна Г.А. с 10 мар на 7 дней',
  17: 'Рюриковна Г.А. с 04 авг на 14 дней',
  18: 'Рюриковна Г.А. с 05 ноя на 10 дней',
  19: 'Васильев П.Г. с 12 май на 7 дней',
  20: 'Васильев П.Г. с 25 авг на 14 дней',
  21: 'Васильев П.Г. с 17 ноя на 7 дней'},
 'имя_легенды': {0: 'Вид отпуска',
  1: None,
  2: None,
  3: None,
  4: None,
  5: None,
  6: None,
  7: None,
  8: None,
  9: None,
  10: None,
  11: None,
  12: None,
  13: None,
  14: None,
  15: None,
  16: None,
  17: None,
  18: None,
  19: None,
  20: None,
  21: None},
 'признак_объекта': {0: 'перенос',
  1: 'перенос',
  2: 'перенос',
  3: 'основной',
  4: 'перенос',
  5: 'основной',
  6: 'основной',
  7: 'перенос',
  8: 'перенос',
  9: 'основной',
  10: 'основной',
  11: 'основной',
  12: 'перенос',
  13: 'перенос',
  14: 'основной',
  15: 'перенос',
  16: 'основной',
  17: 'основной',
  18: 'основной',
  19: 'основной',
  20: 'перенос',
  21: 'основной'},
 'имя_диаграммы': {0: 'График отпусков',
  1: None,
  2: None,
  3: None,
  4: None,
  5: None,
  6: None,
  7: None,
  8: None,
  9: None,
  10: None,
  11: None,
  12: None,
  13: None,
  14: None,
  15: None,
  16: None,
  17: None,
  18: None,
  19: None,
  20: None,
  21: None},
 'имя_вертикали': {0: 'Сотрудник',
  1: None,
  2: None,
  3: None,
  4: None,
  5: None,
  6: None,
  7: None,
  8: None,
  9: None,
  10: None,
  11: None,
  12: None,
  13: None,
  14: None,
  15: None,
  16: None,
  17: None,
  18: None,
  19: None,
  20: None,
  21: None}}

TEXT_INTRODUCTION = """Ganttify позволяет быстро создать диаграмму Ганта на основе заполненной таблицы в Excel, например, для графика отпусков или дорожной карты проекта. Диаграмма Ганта названа в честь американского инженера и менеджера по производству Генри Ганта, который разработал этот инструмент в начале 20 века. Он использовал диаграмму для визуализации графиков выполнения работ и управления проектами.

Заполните таблицу с колонками:
1. объект — элементы для вертикальной оси (например, ФИО сотрудника или этап проекта);
2. старт/финиш — даты в формате день.месяц.год;
3. данные — дополнительная информация, отображаемая при наведении на бар диаграммы;
4. имя_легенды — заголовок легенды (например, 'вид отпуска' или 'ответственный');
5. признак_объекта — дополнительный признак для цветового кодирования баров (например, 'основной' или 'дополнительный' вид отпуска);
6. имя_диаграммы — название диаграммы (например, 'График отпусков инженерного отдела');
7. имя_вертикали — заголовок вертикальной оси (например, 'Сотрудник' или 'Этап').

После заполнения таблицы будет создан файл project_timeline.html с интерактивной диаграммой Ганта на которой:
- при наведении на бар отображается всплывающее окно с дополнительной информацией;
- можно увеличивать и уменьшать масштаб, а также перемещать график для фокусировки на интересующих данных;
- возможно выделение определенных данных с помощью прямоугольной области для детального анализа.
Следуйте приведенной инструкции!"""

TEXT_DATAGANTFILE = """На данном этапе Ganttify создаст файл DataGant.xlsx, который уже будет заполнен примером Графика отпусков в качестве образца.
Заполните файл своими данными по образцу.
Пожалуйста, не редактируйте заголовки столбцов.
Важно, чтобы как минимум первая строка таблицы была заполнена полностью.
Вы можете пользоваться необходимыми инструментами Excel для автоматического формирования данных в таблице, в т.ч. формулами.
Не забудьте сохранить файл после заполнения.
После вернитесь к окну Ganttify для продолжения.
Чтобы открыть файл DataGant.xlsx для заполнения, нажмите Ctrl+r или соответствующую кнопку внизу.
Чтобы сформировать диаграмму, нажмите Ctrl+d или соответствующую кнопку внизу.
"""

TEXT_OPEN_DATAGANTFILE = """Если файл DataGant.xlsx готов, нажмите Ctrl+d или соответствующую кнопку внизу, чтобы сформировать и открыть диаграмму Ганта.
Сформированная диаграмма Ганта будет сохранена под именем project_timeline.html и расположена в папке, откуда запущен Ganttify.
Бары диаграммы окрашиваются в случайные цвета, формируйте диаграмму несколько раз, чтобы получить приемлемую расцветку.
Чтобы вернуться к редактированию DataGant.xlsx, нажмите Ctrl+r или соответствующую кнопку внизу"""

TEXT_MISSING_COL = """Ошибка при загрузке DataGant.xlsx: отсутствует один или несколько необходимых столбцов: {missing_columns_str}.
Возможно, файл был неверно отредактирован.
Пожалуйста, не изменяйте заголовки столбцов.
Нажмите Ctrl+r, чтобы открыть для редактирования DataGant.xlsx"""

TEXT_MISSING_DATA_COL = """Ошибка при загрузки DataGant.xlsx: не заполнена первая строка таблицы в следующих столбцах: {missing_columns_str}.
Возможно, файл был неверно отредактирован.
Пожалуйста, заполните как минимум первую строку таблицы полностью.
Нажмите Ctrl+r, чтобы снова сформировать и открыть для редактирования DataGant.xlsx"""

TEXT_CREATE_CHART = """Сформированная диаграмма Ганта сохранена под именем project_timeline.html и расположена в папке, откуда запущен Ganttify.
Бары диаграммы окрашиваются в случайные цвета, формируйте диаграмму несколько раз, чтобы получить приемлемую расцветку.
Чтобы вернуться к редактированию DataGant.xlsx, нажмите Ctrl+r.
После редактирования не забудьте сохранить изменения и вернитесь к окну Ganttify, чтобы сформировать диаграмму."""

TEXT_ERR_CREATE_CHART = "Ошибка при формировании project_timeline.html"

TEXT_DATAGANTFILE_NOT_FIND = """Ошибка при загрузки DataGant.xlsx: файл не найден.
Возможно, файл был перемещен или удален.
Нажмите Ctrl+r, чтобы снова сформировать и открыть для редактирования DataGant.xlsx"""

TEXT_APP_EXCEL_NOT_FIND = """Ошибка при загрузки DataGant.xlsx: Не удалось открыть файл.
Описание ошибки: {error_app_xls}.
Убедитесь, что Excel установлен и нажмите Ctrl+r, чтобы сформировать и открыть для редактирования DataGant.xlsx"""


correct_columns = ['объект',
                   'старт',
                   'финиш',
                   'данные',
                   'имя_легенды',
                   'признак_объекта',
                   'имя_диаграммы',
                   'имя_вертикали']
